'''
ЗАДАНИЕ №4
Написать программу, которая генерирует в указанных пользователем границах
● случайное целое число,
● случайное вещественное число,
● случайный символ.
Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если
надо получить случайный символ от 'a' до 'f', то вводятся эти символы. Программа должна
вывести на экран любой символ алфавита от 'a' до 'f' включительно.
'''

from random import randint, randrange

# ==============================================================================================

# Случайное полжительное число

num1 = int(input('Введите левую границу дипазона: '))
num2 = int(input('Введите правую границу дипазона: '))
while num1 < 0 or num2 < 0:
    print('Вы ввели отрицательное число! Повторите ввод')
    num1 = int(input('Введите левую границу дипазона: '))
    num2 = int(input('Введите правую границу дипазона: '))
print(f'Случайное число между {num1} и {num2} будет... {randrange(num1, num2)}')

# ==============================================================================================

# Случайное действительное число

num11 = int(input('Введите левую границу дипазона: '))
num22 = int(input('Введите правую границу дипазона: '))

print(f'Случайное число между {num1} и {num2} будет... {randrange(num1, num2)}')

# ==============================================================================================

# Случайный символ по коду

num_chr = int(input('Введите код символа: '))

while num_chr < 1040 or num_chr > 1103:
    print('Нет такого кода символа! Повторите ввод!')
    num_chr = int(input('Введите код символа: '))
print(f'Случайный символ с кодом {num_chr} и будет... {chr(num_chr)}')

# ==============================================================================================

# Случайный символ

custom_chr_l = input('Введите первый символ: ')
custom_chr_r = input('Введите последний символ: ')
new_custom_chr = randrange(ord(custom_chr_l), ord(custom_chr_r))
print(f'Случайный символ между {custom_chr_l} и {custom_chr_r} будет... {chr(new_custom_chr)}')

# ==============================================================================================
